As discussed in the content part of the chapter. These compound datatypes form a very strong foundation of Python Programming. 
<br> Thus, it is very important that you give utmost importance and time to this exercise as it will benefit you a lot in future.
<br> Lets move on the exercise.
<br> **All the best** and most importantly **Have Fun**

# Lists

**Q1 Create a list with vowels.
<br> Name it as 'vowels'
<br> Display vowels**

In [11]:
## START CODE HERE
vowels=['a','e','i','o','u']
vowels
## END CODE HERE

['a', 'e', 'i', 'o', 'u']

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>['a', 'e', 'i', 'o', 'u']</td>
  </tr>
</table>

**Q2 Print first element in vowels. 
<br>Just to be clear first corresponds to 0th element.**

In [12]:
## START CODE HERE
vowels[0]
## END CODE HERE

'a'

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>a</td>
  </tr>
</table>

**Q3 Print last element in vowels.**

In [13]:
## START CODE HERE
vowels[-1]
## END CODE HERE

'u'

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>u</td>
  </tr>
</table>

**Q4 Print all elements in 'vowels' starting from the second element.**

In [14]:
## START CODE HERE
vowels[1:]
## END CODE HERE

['e', 'i', 'o', 'u']

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>['e', 'i', 'o', 'u']</td>
  </tr>
</table>

**Q5 Print alternate elements in the list starting from second element.**

In [15]:
## START CODE HERE
vowels[::2]
## END CODE HERE

['a', 'i', 'u']

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>['e', 'o']</td>
  </tr>
</table>

**Q6 Print all elements in 'vowels' in reverse order.**

In [17]:
## START CODE HERE
vowels[::-1]
vowels
## END CODE HERE

['a', 'e', 'i', 'o', 'u']

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>['u', 'o', 'i', 'e', 'a']</td>
  </tr>
</table>

**Q7 Add all capital vowels to 'vowels' and print the result.
<br> Don't change vowels.**

In [18]:
## START CODE HERE
vowels=vowels+['A','E','I','O','U']
vowels
## END CODE HERE

['a', 'e', 'i', 'o', 'u', 'A', 'E', 'I', 'O', 'U']

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>['a', 'e', 'i', 'o', 'u', 'A','E','I','O','U']</td>
  </tr>
</table>

In [102]:
# Rank, Country name, Number of gold 

common_wealth_2018 = [[1,"Australia",80],[2,"England", 45],[3,"India" , 26],[5,"New Zealand" , 15],[7,"Wales" , 10],[8,"Scotland" , 9]]
common_wealth_2018

[[1, 'Australia', 80],
 [2, 'England', 45],
 [3, 'India', 26],
 [5, 'New Zealand', 15],
 [7, 'Wales', 10],
 [8, 'Scotland', 9]]

**Q8 Append a new entry to common_wealth_2018 [4,"Canada",15]
<br>Print modified 'common_wealth_2018'**

In [103]:
## START CODE HERE
common_wealth_2018=common_wealth_2018+[[4,"Canada",15]]
common_wealth_2018
## END CODE HERE

[[1, 'Australia', 80],
 [2, 'England', 45],
 [3, 'India', 26],
 [5, 'New Zealand', 15],
 [7, 'Wales', 10],
 [8, 'Scotland', 9],
 [4, 'Canada', 15]]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[[1, 'Australia', 80],
 [2, 'England', 45],
 [3, 'India', 26],
 [5, 'New Zealand', 15],
 [7, 'Wales', 10],
 [8, 'Scotland', 9],
 [4, 'Canada', 15]]</td>
  </tr>
</table>

**Q9 Pop the entry at index 6 from common_wealth_2018.
<br> Print the popped item.
<br> Print the modified 'common_wealth_2018'**

In [104]:
## START CODE HERE
print(common_wealth_2018.pop(6))

common_wealth_2018
## END CODE HERE

[4, 'Canada', 15]

[[1, 'Australia', 80],
 [2, 'England', 45],
 [3, 'India', 26],
 [5, 'New Zealand', 15],
 [7, 'Wales', 10],
 [8, 'Scotland', 9]]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td style="text-align:left;">
[4, 'Canada', 15]
<br>
[4, 'Canada', 15]
[[1, 'Australia', 80], [2, 'England', 45], [3, 'India', 26], [5, 'New Zealand', 15], [7, 'Wales', 10], [8, 'Scotland', 9]]</td>
  </tr>
</table>

**Q10 Reverse common_wealth_2018 using appropriate list method
<br> Print the new 'common_wealth_2018'**

In [105]:
## START CODE HERE
bb=common_wealth_2018.reverse
## END CODE HERE

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[[8, 'Scotland', 9], [7, 'Wales', 10], [5, 'New Zealand', 15], [3, 'India', 26], [2, 'England', 45], [1, 'Australia', 80]]
</td>
  </tr>
</table>

**Q11 Sort common_wealth_2018 using appropriate list method
<br> Print the new 'common_wealth_2018'**

In [106]:
## START CODE HERE
sorted(common_wealth_2018)
## END CODE HERE

[[1, 'Australia', 80],
 [2, 'England', 45],
 [3, 'India', 26],
 [5, 'New Zealand', 15],
 [7, 'Wales', 10],
 [8, 'Scotland', 9]]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[[1, 'Australia', 80], [2, 'England', 45], [3, 'India', 26], [5, 'New Zealand', 15], [7, 'Wales', 10], [8, 'Scotland', 9]]
</td>
  </tr>
</table>

**Q12 Fetch the details about India from common_wealth_2018 using indexing**

In [107]:
## START CODE HERE
common_wealth_2018[2]
## END CODE HERE

[3, 'India', 26]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[3, 'India', 26]</td>
  </tr>
</table>

**Q13 Create a new list with the number of gold medals won by each country in common_wealth_2018 using list comprehension.
<br> Name the new list as gold_medals and print gold_medals.
**

In [108]:
## START CODE HERE
b=[]
for i in range(len(common_wealth_2018)):
    b1=common_wealth_2018[i][2]
    b.append(b1)
b
## END CODE HERE

[80, 45, 26, 15, 10, 9]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[80, 45, 26, 15, 10, 9]</td>
  </tr>
</table>

# Tuples

Since we have done a lot of practice on lists, we won't put a lot of time on tuples.

**Q14 common_wealth_2018 is a nested list.
<br> Convert it to a list containing tuples instead of lists.
<br> Remember that common_wealth_2018 contains lists of 3 elements each, it needs to be unpacked using i,j,k.
<br> Reassign it to 'common_wealth_2018'
<br> Display common_wealth_2018**

In [111]:
## START CODE HERE
common_wealth_2018=[tuple(i) for i in common_wealth_2018]
## END CODE HERE

In [112]:
common_wealth_2018

[(1, 'Australia', 80),
 (2, 'England', 45),
 (3, 'India', 26),
 (5, 'New Zealand', 15),
 (7, 'Wales', 10),
 (8, 'Scotland', 9)]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[(1, 'Australia', 80),
 <br>(2, 'England', 45),
 <br>(3, 'India', 26),
 <br>(5, 'New Zealand', 15),
 <br>(7, 'Wales', 10),
 <br>(8, 'Scotland', 9)]</td>
  </tr>
</table>

**Q15 Print the details of Australia in common_wealth_2018.**

In [113]:
## START CODE HERE
tuple(common_wealth_2018[0])
## END CODE HERE

(1, 'Australia', 80)

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>(1, 'Australia', 80)</td>
  </tr>
</table>

**Q16 Print details of the last ranked country in common_wealth_2018.**

In [115]:
## START CODE HERE
tuple(common_wealth_2018[-1])
## END CODE HERE

(8, 'Scotland', 9)

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>(8, 'Scotland', 9)</td>
  </tr>
</table>

**Q17 Print details of all countries in common_wealth_2018 starting from the second one.**

In [116]:
## START CODE HERE
common_wealth_2018[1:]
## END CODE HERE

[(2, 'England', 45),
 (3, 'India', 26),
 (5, 'New Zealand', 15),
 (7, 'Wales', 10),
 (8, 'Scotland', 9)]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[(2, 'England', 45), (3, 'India', 26), (5, 'New Zealand', 15), (7, 'Wales', 10), (8, 'Scotland', 9)]</td>
  </tr>
</table>

**Q18 Print alternate elements in the list starting from second element.**

In [117]:
## START CODE HERE
common_wealth_2018[::2]
## END CODE HERE

[(1, 'Australia', 80), (3, 'India', 26), (7, 'Wales', 10)]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[(2, 'England', 45), (5, 'New Zealand', 15), (8, 'Scotland', 9)]</td>
  </tr>
</table>

**Q19 Print all elements in common_wealth_2018 in reverse order.**

In [118]:
## START CODE HERE
common_wealth_2018[::-1]

## END CODE HERE

[(8, 'Scotland', 9),
 (7, 'Wales', 10),
 (5, 'New Zealand', 15),
 (3, 'India', 26),
 (2, 'England', 45),
 (1, 'Australia', 80)]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[(8, 'Scotland', 9), (7, 'Wales', 10), (5, 'New Zealand', 15), (3, 'India', 26), (2, 'England', 45), (1, 'Australia', 80)]</td>
  </tr>
</table>

**Q20 Sort common_wealth_2018 using appropriate list method
<br> Print the new 'common_wealth_2018'**

In [119]:
## START CODE HERE
sorted(common_wealth_2018)

## END CODE HERE

[(1, 'Australia', 80),
 (2, 'England', 45),
 (3, 'India', 26),
 (5, 'New Zealand', 15),
 (7, 'Wales', 10),
 (8, 'Scotland', 9)]

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>[(1, 'Australia', 80), (2, 'England', 45), (3, 'India', 26), (5, 'New Zealand', 15), (7, 'Wales', 10), (8, 'Scotland', 9)]</td>
  </tr>
</table>

# Dictionaries

We are converting common_wealth_2018 to a dictionary.
<br> Lets see how its done.

In [120]:
common_wealth_2018_dict = {}

for i in common_wealth_2018:
    common_wealth_2018_dict[i[0]] = {"name" : i[1], "gold medals" : i[2]}

In [121]:
common_wealth_2018_dict

{1: {'name': 'Australia', 'gold medals': 80},
 2: {'name': 'England', 'gold medals': 45},
 3: {'name': 'India', 'gold medals': 26},
 5: {'name': 'New Zealand', 'gold medals': 15},
 7: {'name': 'Wales', 'gold medals': 10},
 8: {'name': 'Scotland', 'gold medals': 9}}

**Q21 Now that common_wealth_2018_dict is ready, print the name of the country which is ranked 5th. **

In [124]:
## START CODE HERE
common_wealth_2018_dict[5]['name']

## END CODE HERE

'New Zealand'

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>New Zealand</td>
  </tr>
</table>

**Q22 Print the number of gold medals won by India.**

In [125]:
## START CODE HERE
common_wealth_2018_dict[3]['gold medals']
## END CODE HERE

26

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>26</td>
  </tr>
</table>

**Q23 Print the details of the country ranked 7th.**

In [132]:
## START CODE HERE
common_wealth_2018_dict[7].values()
## END CODE HERE

dict_values(['Wales', 10])

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td style="text-align:left;">Wales
<br>10</td>
  </tr>
</table>

# Sets

We have provided you with 3 sets Python, R , SAS which contains the names of students who have taken the course for those subjects.

In [135]:
Python = {"Ashok", "Amit", "Ankit", "Rajesh", "David", "Zakir", "Naina", "Saina"}
R = {"Akanksha", "Ankit", "Aarti", "Manish", "Naina", "Amit"}
SAS = {"Naresh", "Ankit", "Ravi", "David", "Zakir", "Lokesh", "Manish"}

**Q24 A new student "Nandini" has decided to enroll for Python and SAS courses.
<br> Add her name to both the sets and print the sets.**

In [147]:
## START CODE HERE
Python.add('Nandini')
SAS.add('Nandini')
print(Python)
print(SAS)
## END CODE HERE

{'Zakir', 'Ashok', 'Nandini', 'Ankit', 'David', 'Amit', 'Naina', 'Rajesh', 'Saina'}
{'Naresh', 'Zakir', 'Ravi', 'Nandini', 'David', 'Lokesh', 'Manish', 'Ankit'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td style="text-align:left;">{'Amit', 'Naina', 'Ankit', 'Zakir', 'Rajesh', 'Nandini', 'Ashok', 'David', 'Saina'}
<br>{'Ankit', 'Zakir', 'Ravi', 'Nandini', 'Naresh', 'David', 'Manish', 'Lokesh'}</td>
  </tr>
</table>

**Q25 Lokesh has decided to leave the SAS course.
<br> Remove his name from the set and then print it.**

In [153]:
## START CODE HERE
#SAS.remove('Lokesh')
SAS
## END CODE HERE

{'Ankit', 'David', 'Manish', 'Nandini', 'Naresh', 'Ravi', 'Zakir'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>{'Ankit', 'Zakir', 'Ravi', 'Nandini', 'Naresh', 'David', 'Manish'}</td>
  </tr>
</table>

All the questions from now, have one line solution

**Q26 Print the names of all students from all courses.
<br>TIP: Try to do it in one line code using '|' operator**

In [154]:
## START CODE HERE
Python | SAS
## END CODE HERE

{'Amit',
 'Ankit',
 'Ashok',
 'David',
 'Manish',
 'Naina',
 'Nandini',
 'Naresh',
 'Rajesh',
 'Ravi',
 'Saina',
 'Zakir'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>{'Amit', 'Naina', 'Ankit', 'Rajesh', 'Ashok', 'Aarti', 'Saina', 'Manish', 'Akanksha', 'Zakir', 'Ravi', 'Nandini', 'Naresh', 'David'}</td>
  </tr>
</table>

**Q27 Print the names of students who are taking all three courses together. (In simple words, the names which are common in all three sets)**

In [155]:
## START CODE HERE
Python & R & SAS

## END CODE HERE

{'Ankit'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>{'Ankit'}</td>
  </tr>
</table>

**Q28 Print the names of students who are taking Python course but not the R and SAS courses. (In simple words, the names which are present in Python set but not in R and SAS sets) **

In [156]:
## START CODE HERE
Python-(R|SAS)

## END CODE HERE

{'Ashok', 'Rajesh', 'Saina'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>{'Saina', 'Rajesh', 'Ashok'}</td>
  </tr>
</table>

**Q29 Print the names of students who are taking only Python course or only R course or only course. (In simple words, the names which are not common to any combination of given sets) 
<br> For eg. Saina is taking only the Python course and no other course.**

In [157]:
## START CODE HERE
Python ^ R ^ SAS

## END CODE HERE

{'Aarti', 'Akanksha', 'Ankit', 'Ashok', 'Naresh', 'Rajesh', 'Ravi', 'Saina'}

<table>
  <tr>
  <td>**Expected Output:**<td>
    <td>{'Ankit', 'Ravi', 'Rajesh', 'Naresh', 'Ashok', 'Aarti', 'Saina', 'Akanksha'}</td>
  </tr>
</table>

# Congratulations

You are through the third assignment of the Basic Python Programming Course.
<br> This chapter was the most important part of the course, this will help you a lot in your data science career.  
Further in the course we'll try to enhance your knowledge and understanding of compound datatypes and also learn various access techniques. 
<br>Buckle up!
<br>You are doing very well.
<br>See you in the next chapter.